benchmark/leveldb/results/ratio/mris_ratio_hybrid.16.1.log
LevelDB:    version 1.5
Date:       Sun Dec  2 23:25:44 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2778.482 micros/op;    5.3 MB/s small: 5000/0; big: 313/0
Microseconds per op:
Count: 5313  Average: 2778.5193  StdDev: 5688.88
Min: 0.0000  Median: 1476.7038  Max: 58326.0000
------------------------------------------------------
[       0,       1 )       4   0.075%   0.075% 
[       1,       2 )       9   0.169%   0.245% 
[       2,       3 )      30   0.565%   0.809% 
[       3,       4 )       5   0.094%   0.903% 
[      20,      25 )      10   0.188%   1.092% 
[      25,      30 )      45   0.847%   1.939% 
[      30,      35 )     236   4.442%   6.381% #
[      35,      40 )     368   6.926%  13.307% #
[      40,      45 )     378   7.115%  20.422% #
[      45,      50 )      30   0.565%  20.986% 
[      50,      60 )      31   0.583%  21.570% 
[      60,      70 )       2   0.038%  21.607% 
[      70,      80 )       3   0.056%  21.664% 
[      80,      90 )      66   1.242%  22.906% 
[      90,     100 )     176   3.313%  26.219% #
[     100,     120 )     185   3.482%  29.701% #
[     120,     140 )     110   2.070%  31.771% 
[     140,     160 )      69   1.299%  33.070% 
[     160,     180 )      29   0.546%  33.616% 
[     180,     200 )      15   0.282%  33.898% 
[     200,     250 )      13   0.245%  34.143% 
[     250,     300 )       1   0.019%  34.161% 
[     400,     450 )       5   0.094%  34.256% 
[     450,     500 )       5   0.094%  34.350% 
[     500,     600 )       5   0.094%  34.444% 
[     600,     700 )       5   0.094%  34.538% 
[     700,     800 )      17   0.320%  34.858% 
[     800,     900 )      39   0.734%  35.592% 
[     900,    1000 )      94   1.769%  37.361% 
[    1000,    1200 )     212   3.990%  41.351% #
[    1200,    1400 )     150   2.823%  44.175% #
[    1400,    1600 )     807  15.189%  59.364% ###
[    1600,    1800 )      69   1.299%  60.663% 
[    1800,    2000 )      10   0.188%  60.851% 
[    2000,    2500 )      53   0.998%  61.848% 
[    2500,    3000 )    1422  26.765%  88.613% #####
[    3000,    3500 )     271   5.101%  93.714% #
[    3500,    4000 )      18   0.339%  94.052% 
[    4000,    4500 )       1   0.019%  94.071% 
[    4500,    5000 )       2   0.038%  94.109% 
[    5000,    6000 )       1   0.019%  94.128% 
[   10000,   12000 )       2   0.038%  94.165% 
[   12000,   14000 )       1   0.019%  94.184% 
[   14000,   16000 )       9   0.169%  94.353% 
[   16000,   18000 )      21   0.395%  94.749% 
[   18000,   20000 )      15   0.282%  95.031% 
[   20000,   25000 )     121   2.277%  97.308% 
[   25000,   30000 )     109   2.052%  99.360% 
[   30000,   35000 )      30   0.565%  99.925% 
[   35000,   40000 )       1   0.019%  99.944% 
[   40000,   45000 )       1   0.019%  99.962% 
[   50000,   60000 )       2   0.038% 100.000% 

----- /mnt/largespace/mris_ratio_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	313
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0