benchmark/leveldb/results/ratio/mris_ratio_hybrid.32.3.log
LevelDB:    version 1.5
Date:       Sun Dec  2 23:26:54 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2193.259 micros/op;    5.2 MB/s small: 5000/0; big: 157/0
Microseconds per op:
Count: 5157  Average: 2193.2963  StdDev: 4349.88
Min: 0.0000  Median: 1476.4634  Max: 50614.0000
------------------------------------------------------
[       0,       1 )       2   0.039%   0.039% 
[       1,       2 )       4   0.078%   0.116% 
[       2,       3 )      15   0.291%   0.407% 
[       3,       4 )       1   0.019%   0.427% 
[      18,      20 )       1   0.019%   0.446% 
[      20,      25 )       9   0.175%   0.621% 
[      25,      30 )      46   0.892%   1.513% 
[      30,      35 )      76   1.474%   2.986% 
[      35,      40 )     430   8.338%  11.324% ##
[      40,      45 )     370   7.175%  18.499% #
[      45,      50 )      18   0.349%  18.848% 
[      50,      60 )      48   0.931%  19.779% 
[      60,      70 )       5   0.097%  19.876% 
[      70,      80 )       1   0.019%  19.895% 
[      80,      90 )      73   1.416%  21.311% 
[      90,     100 )     193   3.742%  25.053% #
[     100,     120 )     185   3.587%  28.641% #
[     120,     140 )     117   2.269%  30.909% 
[     140,     160 )      59   1.144%  32.054% 
[     160,     180 )      28   0.543%  32.596% 
[     180,     200 )      17   0.330%  32.926% 
[     200,     250 )      10   0.194%  33.120% 
[     250,     300 )       2   0.039%  33.159% 
[     400,     450 )       5   0.097%  33.256% 
[     450,     500 )       6   0.116%  33.372% 
[     500,     600 )       4   0.078%  33.450% 
[     600,     700 )       3   0.058%  33.508% 
[     700,     800 )      16   0.310%  33.818% 
[     800,     900 )      38   0.737%  34.555% 
[     900,    1000 )      97   1.881%  36.436% 
[    1000,    1200 )     228   4.421%  40.857% #
[    1200,    1400 )     158   3.064%  43.921% #
[    1400,    1600 )     820  15.901%  59.822% ###
[    1600,    1800 )      77   1.493%  61.315% 
[    1800,    2000 )      11   0.213%  61.528% 
[    2000,    2500 )      57   1.105%  62.633% 
[    2500,    3000 )    1480  28.699%  91.332% ######
[    3000,    3500 )     264   5.119%  96.451% #
[    3500,    4000 )      23   0.446%  96.897% 
[    4000,    4500 )       1   0.019%  96.917% 
[    5000,    6000 )       1   0.019%  96.936% 
[    6000,    7000 )       1   0.019%  96.956% 
[   12000,   14000 )       2   0.039%  96.994% 
[   14000,   16000 )       3   0.058%  97.053% 
[   16000,   18000 )       7   0.136%  97.188% 
[   18000,   20000 )      10   0.194%  97.382% 
[   20000,   25000 )      55   1.067%  98.449% 
[   25000,   30000 )      57   1.105%  99.554% 
[   30000,   35000 )      20   0.388%  99.942% 
[   35000,   40000 )       1   0.019%  99.961% 
[   50000,   60000 )       2   0.039% 100.000% 

----- /mnt/largespace/mris_ratio_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	157
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0