benchmark/leveldb/results/ratio/mris_ratio_hybrid.64.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 23:27:15 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1879.209 micros/op;    5.1 MB/s small: 5000/0; big: 79/0
Microseconds per op:
Count: 5079  Average: 1879.2479  StdDev: 3357.23
Min: 1.0000  Median: 1476.7107  Max: 52880.0000
------------------------------------------------------
[       1,       2 )       2   0.039%   0.039% 
[       2,       3 )       3   0.059%   0.098% 
[       3,       4 )       4   0.079%   0.177% 
[       4,       5 )       1   0.020%   0.197% 
[      20,      25 )      13   0.256%   0.453% 
[      25,      30 )      41   0.807%   1.260% 
[      30,      35 )      79   1.555%   2.816% 
[      35,      40 )     396   7.797%  10.612% ##
[      40,      45 )     326   6.419%  17.031% #
[      45,      50 )      39   0.768%  17.799% 
[      50,      60 )      45   0.886%  18.685% 
[      60,      70 )       9   0.177%  18.862% 
[      70,      80 )       2   0.039%  18.901% 
[      80,      90 )      76   1.496%  20.398% 
[      90,     100 )     218   4.292%  24.690% #
[     100,     120 )     173   3.406%  28.096% #
[     120,     140 )     107   2.107%  30.203% 
[     140,     160 )      69   1.359%  31.561% 
[     160,     180 )      24   0.473%  32.034% 
[     180,     200 )      14   0.276%  32.310% 
[     200,     250 )      13   0.256%  32.565% 
[     250,     300 )       2   0.039%  32.605% 
[     400,     450 )       5   0.098%  32.703% 
[     450,     500 )       4   0.079%  32.782% 
[     500,     600 )       6   0.118%  32.900% 
[     600,     700 )       3   0.059%  32.959% 
[     700,     800 )      15   0.295%  33.255% 
[     800,     900 )      38   0.748%  34.003% 
[     900,    1000 )      96   1.890%  35.893% 
[    1000,    1200 )     232   4.568%  40.461% #
[    1200,    1400 )     165   3.249%  43.709% #
[    1400,    1600 )     833  16.401%  60.110% ###
[    1600,    1800 )      69   1.359%  61.469% 
[    1800,    2000 )      11   0.217%  61.685% 
[    2000,    2500 )      61   1.201%  62.886% 
[    2500,    3000 )    1511  29.750%  92.636% ######
[    3000,    3500 )     268   5.277%  97.913% #
[    3500,    4000 )      22   0.433%  98.346% 
[    4000,    4500 )       2   0.039%  98.386% 
[    5000,    6000 )       3   0.059%  98.445% 
[   12000,   14000 )       2   0.039%  98.484% 
[   16000,   18000 )       1   0.020%  98.504% 
[   18000,   20000 )       7   0.138%  98.641% 
[   20000,   25000 )      22   0.433%  99.075% 
[   25000,   30000 )      36   0.709%  99.783% 
[   30000,   35000 )       8   0.158%  99.941% 
[   35000,   40000 )       1   0.020%  99.961% 
[   50000,   60000 )       2   0.039% 100.000% 

----- /mnt/largespace/mris_ratio_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	79
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0