benchmark/leveldb/results/ratio/mris_ratio_hybrid.8.3.log
LevelDB:    version 1.5
Date:       Sun Dec  2 23:25:22 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    3812.191 micros/op;    5.5 MB/s small: 5000/0; big: 625/0
Microseconds per op:
Count: 5625  Average: 3812.2267  StdDev: 7320.19
Min: 0.0000  Median: 1477.4064  Max: 60057.0000
------------------------------------------------------
[       0,       1 )       6   0.107%   0.107% 
[       1,       2 )      22   0.391%   0.498% 
[       2,       3 )     110   1.956%   2.453% 
[       3,       4 )       4   0.071%   2.524% 
[      12,      14 )       1   0.018%   2.542% 
[      20,      25 )       5   0.089%   2.631% 
[      25,      30 )     224   3.982%   6.613% #
[      30,      35 )     233   4.142%  10.756% #
[      35,      40 )     352   6.258%  17.013% #
[      40,      45 )     374   6.649%  23.662% #
[      45,      50 )      26   0.462%  24.124% 
[      50,      60 )      33   0.587%  24.711% 
[      60,      70 )       3   0.053%  24.764% 
[      70,      80 )       6   0.107%  24.871% 
[      80,      90 )      46   0.818%  25.689% 
[      90,     100 )     148   2.631%  28.320% #
[     100,     120 )     199   3.538%  31.858% #
[     120,     140 )     103   1.831%  33.689% 
[     140,     160 )      69   1.227%  34.916% 
[     160,     180 )      24   0.427%  35.342% 
[     180,     200 )      25   0.444%  35.787% 
[     200,     250 )      18   0.320%  36.107% 
[     250,     300 )       3   0.053%  36.160% 
[     400,     450 )       5   0.089%  36.249% 
[     450,     500 )       4   0.071%  36.320% 
[     500,     600 )       7   0.124%  36.444% 
[     600,     700 )       4   0.071%  36.516% 
[     700,     800 )      15   0.267%  36.782% 
[     800,     900 )      35   0.622%  37.404% 
[     900,    1000 )      83   1.476%  38.880% 
[    1000,    1200 )     202   3.591%  42.471% #
[    1200,    1400 )     134   2.382%  44.853% 
[    1400,    1600 )     748  13.298%  58.151% ###
[    1600,    1800 )      60   1.067%  59.218% 
[    1800,    2000 )       8   0.142%  59.360% 
[    2000,    2500 )      48   0.853%  60.213% 
[    2500,    3000 )    1334  23.716%  83.929% #####
[    3000,    3500 )     260   4.622%  88.551% #
[    3500,    4000 )      15   0.267%  88.818% 
[    4000,    4500 )       3   0.053%  88.871% 
[    4500,    5000 )       1   0.018%  88.889% 
[    5000,    6000 )       2   0.036%  88.924% 
[   10000,   12000 )       5   0.089%  89.013% 
[   12000,   14000 )      20   0.356%  89.369% 
[   14000,   16000 )      22   0.391%  89.760% 
[   16000,   18000 )      29   0.516%  90.276% 
[   18000,   20000 )      65   1.156%  91.431% 
[   20000,   25000 )     227   4.036%  95.467% #
[   25000,   30000 )     199   3.538%  99.004% #
[   30000,   35000 )      52   0.924%  99.929% 
[   35000,   40000 )       2   0.036%  99.964% 
[   50000,   60000 )       1   0.018%  99.982% 
[   60000,   70000 )       1   0.018% 100.000% 

----- /mnt/largespace/mris_ratio_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	625
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0